Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/consumer_protection_codes_and_mortgages.html.txt.tmx
Source language: en
Languages: ga

source: Consumer protection codes and mortgages
ga: Cóid um chosaint tomhaltóirí agus morgáistí

source: • Code of Conduct on Mortgage Arrears (CCMA)
ga: • Cód Iompair um Riaráistí Morgáiste (CIRM)

source: • Consumer Protection Code 2012
ga: • Cód um Chosaint Tomhaltóirí

source: Lending institutions such as banks and building societies are bound by two statutory codes of conduct in relation to mortgages
ga: Tá institiúidí iasachta, ar nós banc agus cumainn foirgníochta, faoi cheangal ag dhá chód iompair reachtúla i dtaca le morgáistí

source: These are the Central Bank's Code of Conduct on Mortgage Arrears (CCMA) and its Consumer Protection Code 2012
ga: Is iad seo an Cód Iompair maidir le Riaráistí Morgáiste de chuid an Bhainc Cheannais (CIRM) agus an Cód um Chosaint Tomhaltóirí, 2012 lena ngabhann

source: Local authorities operate under similar rules
ga: Oibríonn údaráis áitiúla faoina mhacasamhail de rialacha de ghnáth

source: For people having difficulty repaying local authority loans, two pieces of legislation, along with a set of guidelines, provide for the local authority to make arrangements to deal with the situation - (see ‘Local authority loans’ below)
ga: Maidir le daoine a bhfuil deacrachtaí acu agus na hiasachtaí atá acu ón údarás áitiúil a aisíoc, tá dhá phíosa reachtaíochta ann, mar aon le treoirlínte, a fhorálann go ndéanfaidh an t-údarás áitiúil socruithe chun déileáil leis an gcás – (féach ‘Iasachtaí ó údaráis áitiúla’ thíos)

source: If you are having difficulties paying your mortgage, you should talk to the lending institution as soon as possible
ga: Má tá deacrachtaí agat do mhorgáiste a íoc, ba cheart duit labhairt leis an institiúid iasachta a luaithe is féidir

source: Your lender must take certain steps to deal with any problems you have in paying your mortgage
ga: Ní mór do d’iasachtóir roinnt bearta a ghlacadh chun déileáil le haon fhadhbanna atá agat maidir le do mhorgáiste a íoc

source: Repossessing your home should be the lender's last resort
ga: Ba cheart go mbeadh athshealbhú do thí beart deiridh an iasachtóra

source: Code of Conduct on Mortgage Arrears (CCMA)
ga: Cód Iompair um Riaráistí Morgáiste (CIRM)

source: The current version of the Central Bank’s Code of Conduct on Mortgage Arrears (CCMA) came into effect on 1 July 2013
ga: Tháinig leagan nua Chód Iompair um Riaráistí Morgáiste (CIRM) an Bhainc Cheannais i bhfeidhm an 1 Iúil 2013

source: This is the main code of relevance to people whose mortgage is in arrears or in danger of slipping into arrears
ga: Is é seo an príomhchód ábhartha do dhaoine a bhfuil a morgáiste tar éis riaráistí a chruthú nó atá i mbaol riaráistí a chruthú

source: The CCMA requires mortgage lenders to adopt specific procedures when dealing with borrowers experiencing arrears and financial difficulties
ga: Ceanglaíonn an CIRM ar iasachtóirí morgáiste glacadh le nósanna imeachta sonracha nuair a bhíonn siad ag déileáil le hiasachtaithe atá thíos le deacrachtaí airgeadais agus le riaráistí

source: Such procedures must be aimed at helping you as far as possible in your own particular circumstances
ga: Ní mór go ndíreofar na nósanna imeachta siúd ar chabhrú leat sa mhéid is féidir faoi do chúinsí féin ar leith

source: In general, the CCMA requires lenders to wait 8 months before taking legal action about mortgages in arrears
ga: Go ginearálta, ceanglaíonn an CIRM ar iasachtóirí fanacht 8 mí sula dtugann siad faoi chaingean dlí faoi mhorgáistí ag a bhfuil riaráistí

source: However, this requirement does not apply if a borrower is deliberately not co-operating with the lender - see below
ga: Ní bhíonn an ceanglas seo i gceist mura bhfuil iasachtaí ag comhoibriú leis an iasachtóir d’aon turas – féach thíos

source: Regardless of how long it takes your lender to assess your case, and provided that you are co-operating, you must be given 3 months’ notice before they can commence legal proceedings where either:
ga: Beag beann ar an bhfad a ghlacann sé ar d’iasachtóir do chás a mheas, agus a fhad agus a bhíonn tú ag comhoibriú, ní mór go dtabharfar fógra 3 mhí duit, ar a laghad, sular féidir leo tús a chur le himeachtaí dlí:

source: • Your lender does not offer you an alternative repayment arrangement for your mortgage
ga: • Sa chás nach gcuireann d’iasachtóir socrú eile aisíoctha ar tairiscint duit do do mhorgáiste

source: • You do not accept an alternative repayment arrangement offered to you
ga: • Sa chás nach nglacann tú le socrú eile aisíoctha a cuireadh ar tairiscint duit

source: This will give you time to consider other options, such as voluntary surrender, voluntary sale or a Personal Insolvency Arrangement
ga: Tabharfaidh seo roinnt ama duit chun machnamh a dhéanamh ar roghanna eile, ar nós géilleadh deonach, díol deonach nó Socrú Dócmhainneachta Pearsanta

source: You may be classified as not co-operating with your lender if you:
ga: D’fhéadfaí a mheas nach bhfuil tú ag comhoibriú:

source: • Do not fully and honestly disclose significant information or
ga: • Mura nochtann tú faisnéis thábhachtach go hiomlán agus go hionraic nó

source: • Fail to provide relevant information within a reasonable time or
ga: • Má theipeann ort an fhaisnéis ábhartha a sholáthar laistigh de thráth réasúnta nó

source: • Are in arrears for 3 months, during which you either failed to contact the lender or respond to its communications, or your response is insufficient for a complete assessment of your circumstances or
ga: • Má tá tú i riaráistí ar feadh trí mhí, agus theip ort, lena linn sin, teagmháil a dhéanamh leis an iasachtóir nó chun freagra a thabhairt ar a t(h)eagmháil leat, nó níor leor d’fhreagra chun measúnú iomlán a dhéanamh ar do chúinsí nó

source: • Have entered an alternative repayment arrangement and 3 months have passed, during which you have not fully made the alternative repayments or
ga: • Má d’iontráil tú comhaontú eile aisíoctha agus tá trí mhí caite, agus ní dhearna tú na híocaíochtaí eile go hiomlán lena linn nó

source: • Have not entered an alternative repayment arrangement and 3 months have passed, during which you have not fully paid your mortgage or have not cleared your arrears
ga: • Murar iontráil tú comhaontú eile aisíoctha agus tá trí mhí caite, agus níor íoc tú do mhorgáiste agus níor íoc tú do chuid riaráistí

source: Before classifying you as not co-operating, the lender must write to you, giving you 20 business days to take specific actions to enable it to assess your circumstances
ga: Sula meastar nach bhfuil tú ag comhoibriú, is gá don iasachtóir scríobh chugat, agus 20 lá gnó a thabhairt duit chun gníomhartha sonracha a ghlacadh chun cabhrú leis/léi do chuid cúinsí a mheas

source: It must warn you about the implications of not co-operating and suggest that you seek appropriate advice
ga: Ní mór dóibh foláireamh a thabhairt duit ar na hiarmhairtí a bheidh i gceist mura gcomhoibríonn tú agus a mholadh duit go lorgaíonn tú an chomhairle chuí

source: It must also highlight the position about debt outstanding after repossession or sale
ga: Sa mhullach air sin, d’fhéadfaidís an cheist a phlé leat maidir le fiachas a bheith fós le híoc tar éis athshealbhú nó díola

source: If you are classified as not co-operating, you lose the protections of the MARP and your lender may commence legal proceedings immediately
ga: Má dhéantar thú a rangú gan bheith ag comhoibriú, ní bhronnfar ort cosaint an CIRP agus féadfaidh an t-iasachtóir tús a chur le himeachtaí dlí láithreach

source: Before you can be classified as not co-operating, your lender must first write to you and warn you that this might happen and tell you what steps you need to take to avoid being classified as not co-operating
ga: Sular féidir thú a rangú gan bheith ag comhoibriú, ní mór do d’iasachtóir scríobh chugat agus an foláireamh a thabhairt duit go bhféadfadh seo tarlú agus insint duit cén céimeanna is gá duit glacadh d’fhonn nach ndéanfar thú a rangú gan bheith ag comhoibriú

source: You may appeal the decision to classify you as not co-operating
ga: Féadfaidh tú an cinneadh a achomharc go rangófar thú gan bheith ag comhoibriú

source: The CCMA applies to mortgages on primary residences only
ga: Baineann an CIRM le morgáistí maidir le príomháiteanna cónaithe amháin

source: It defines primary residence to include “a residential property in this State which is the only residential property owned by the borrower” as well as the more common definition of “the residential property which the borrower occupies as his/her primary residence in this State” (your main home)
ga: Sainmhínítear sa Chód príomháit chónaithe mar seo a leanas, “réadmhaoin chónaithe sa Stát seo arb í an réadmhaoin chónaithe amháin atá faoi úinéireacht an iasachtaí”, mar aon leis an sainmhíniú níos coitianta – “an réadmhaoin chónaithe atá á háitiú ag an iasachtaí mar a p(h)ríomháit chónaithe sa Stát seo” (do phríomhtheach)

source: The purpose of this wider definition is to apply the protections of the CCMA to people who are trying to maximise their income to help pay the mortgage on their main residence or home, whether or not they actually live in it
ga: Is í aidhm an tsainmhínithe níos fairsinge seo cosaintí an CIRM a chur i bhfeidhm do dhaoine atá ag iarraidh a n-ioncam a uasmhéadú chun cuidiú leis an morgáiste a íoc ar a bpríomháit chónaithe nó ar a bpríomhtheach, má chónaíonn siad ann nó a mhalairt

source: The Code also covers borrowers in pre-arrears
ga: Cuimsítear sa Chód, freisin, iasachtaithe i réamhriaráistí

source: The CCMA applies to all regulated mortgage lenders operating in the State when dealing with borrowers facing or in mortgage arrears on their primary residence, including any mortgage lending activities outsourced by these lenders
ga: Tugtar an sainmhíniú a leanas ar réamhriaráistí: “Eascraíonn cás réamhriaráistí sa chás go ndéanann an t-iasachtaí teagmháil leis an iasachtóir chun a chur in iúl dóibh go bhfuil deacrachtaí airgeadais ag bagairt orthu agus/nó go bhfuil siad buartha faoi riaráistí morgáiste a chruthú”

source: Under the Consumer Protection (Regulation of Credit Servicing Firms) Act 2015, the CCMA also applies to credit servicing firms, which are firms that manage mortgages or other loans on behalf of unregulated entities
ga: Baineann an CIRM le gach iasachtóir morgáiste a oibríonn sa Stát (agus atá rialáilte ag an mBanc Ceannais) agus iad ag deileáil le h-iasachtaithe atá i riaráistí morgáiste nó i mbaol riaráistí morgáiste

source: As a result, people whose mortgages are transferred to unregulated entities have the same protection that they had before the loan was sold
ga: Ní bhaineann sé le comhair chreidmheasa nó le h-údaráis áitiúla (féach ‘Iasachtaí ó údaráis áitiúla’ thíos)

source: The Consumer Protection (Regulation of Credit Servicing Firms) Act 2015 provides that people whose mortgages have been transferred to unregulated entities will have the same protection that they had before the loan was sold
ga: Foráiltear san Acht um Chosaint Tomhaltóirí (Gnólachtaí Seirbhísithe Creidmheasa a Rialáil), 2015 go mbeidh an chosaint chéanna ag daoine ar aistríodh a morgáistí chuig aonáin neamhrialáilte a bhí acu sular díoladh an iasacht

source: The CCMA sets out the framework that lenders must use when dealing with borrowers in mortgage arrears or in pre-arrears
ga: Leagtar amach sa CIRM an chreatlach nach mór d’iasachtóirí úsáid nuair a bhíonn siad ag déileáil le hiasachtóirí a chruthaigh riaráistí morgáiste nó atá i réamhriaráistí

source: It requires lenders to handle all such cases sympathetically and positively, with the objective at all times of helping people to meet their mortgage obligations
ga: Ceanglaítear ar iasachtóirí gach cás den chineál sin a láimhseáil go báúil agus go dearfach, agus é i gcónaí bheith i gceist acu cabhrú le daoine a gcuid oibleagáidí morgáiste a chomhlíonadh

source: Under the CCMA, lenders must have the following:
ga: Ní mór d’iasachtóirí an méid a leanas a bheith acu faoin gCIRM:

source: • A Mortgage Arrears Resolution Process (MARP) to be used when dealing with arrears and pre-arrears customers
ga: • Próiseas Réitigh do Riaráistí Morgáiste (PRRM) a úsáidtear nuair atáthar ag déileáil le custaiméirí riaráistí agus réamhriaráistí

source: The 4 steps for the MARP are:
ga: Is iad na 4 chéim don PRRM:

source: Read more about the Mortgage Arrears Resolution Process
ga: Léigh níos mó faoin bPróiseas Réitigh do Riaráistí Morgáiste

source: • An Arrears Support Unit (ASU) to assess arrears and pre-arrears cases
ga: • Aonad Tacaíochta Riaráistí (ATR) le measúnú a dhéanamh ar chásanna riaráistí agus réamhriaráistí

source: • An internal Appeals Board to consider appeals from borrowers in relation to ASU
ga: • Bord Achomharc inmheánach chun breithniú a dhéanamh ar achomhairc ó iasachtaithe maidir le cinntí ATR agus le láimhseáil iasachtóra chás an iasachtaí faoin PRRM

source: • Ensure that communications with borrowers are presented in a clear and consumer-friendly manner and that the level of communications from the lender, or any third party acting on its behalf, is proportionate and not excessive, taking into account the borrower’s circumstances
ga: • A chinntiú nach go léirítear cumarsáid le hiasachtaithe ar bhealach soiléir agus a oireann do thomhaltóirí agus go bhfuil an leibhéal cumarsáide ón iasachtóir, nó ó aon tríú páirtí a ghníomhaíonn ar a s(h)on, comhréireach agus gan bheith iomarcach, agus cúinsí an iasachtaí a chur san áireamh

source: • Not make unnecessarily frequent communications
ga: • Gan cumarsáid rialta gan ghá a dhéanamh

source: • Ensure that communications with borrowers are not aggressive, intimidating or harassing
ga: • A chinntiú nach bhfuil an chumarsáid a dhéantar le hiasachtaithe ina iompar ionsaitheach, imeaglach nó ciaptha

source: • Ensure that borrowers are given sufficient time to complete an action they have committed to before follow-up communication is attempted
ga: • A chinntiú go dtugtar dóthain ama d’iasachtaithe chun gníomh a chur i gcrích ar thug siad gealltanas ina leith sula ndéantar iarracht tabhairt faoi chumarsáid leantach

source: • Make an information booklet available to borrowers in arrears (or pre-arrears) including details on the MARP, relevant contact points for arrears issues and details of websites with mortgage arrears information, such as mabs.ie and keepingyourhome.ie
ga: • Leabhrán faisnéise a chur ar fáil d’iasachtaithe a chruthaigh riaráistí (nó atá i mbaol riaráistí a chruthú), lena n-áirítear sonraí faoin PRRM, na pointí ábhartha teagmhála le haghaidh saincheisteanna riaráistí agus sonraí faoi láithreáin ghréasáin ar a bhfuil faisnéis faoi riaráistí morgáiste, ar nós mabs.ie agus keepingyourhome.ie

source: • Provide a dedicated section on their website for borrowers who are in or facing financial difficulties
ga: • Mír thiomnaithe a sholáthar ar a láithreán gréasáin d’iasachtaithe ag a bhfuil deacrachtaí airgeadais nó atá i mbaol deacrachtaí airgeadais Ní mór go n-áireofar sa mhír seo an leabhrán thuas agus naisc leis na láithreáin ghréasáin thuas

source: • Wait at least 8 months before applying to the courts to commence legal action for repossession of a property (this does not apply if the borrower is not co-operating with the lender)
ga: • Fan ar a laghad 8 mí sula ndéantar iarratas ar na cúirteanna chun tús a chur le caingean dlí maidir le hathshealbhú réadmhaoine (ní bhaineann seo mura bhfuil an t-iasachtaí ag comhoibriú leis an iasachtóir)

source: • Require a borrower to change from an existing tracker mortgage to another mortgage type as part of an alternative arrangement offered to the borrower in arrears or pre-arrears, unless none of the options that would allow the borrower to retain the tracker interest rate are appropriate and sustainable for the borrower’s individual circumstances
ga: • Iarraidh ar iasachtaí athrú ó mhorgáiste reatha rianúcháin go dtí saghas eile de mhorgáiste, mar chuid de shocrú eile a cuireadh ar tairiscint don iasachtaí ag a bhfuil riaráistí nó atá i mbaol riaráistí mura bhfuil aon cheann de na roghanna a ligfeadh don iasachtaí an ráta úis rianúcháin a choimeád oiriúnach agus inmharthana i dtaca le cúinsí aonair an iasachtaí

source: If this is the case, the lender may offer the borrower an alternative repayment arrangement which requires the borrower to change from an existing tracker mortgage to another mortgage type provided that:
ga: Más amhlaidh an cás, féadfaidh an t-iasachtóir socrú eile aisíoctha a thairiscint don iasachtaí a iarann ar an iasachtaí chun athrú ó mhorgáiste reatha rianúcháin go dtí saghas eile de mhorgáiste:

source: • An alternative repayment arrangement is affordable for the borrower, and
ga: • A fhad agus go bhfuil socrú eile aisíoctha inacmhainne don iasachtaí, agus

source: • It is a long-term sustainable solution which is consistent with Central Bank of Ireland policy on sustainability
ga: • A fhad agus is réiteach fadtéarma inmharthana é atá ar aon dul le beartas Bhanc Ceannais na hÉireann maidir le hinmharthanacht

source: If you are not happy with the lender’s treatment of your case, or if you feel they have not complied with the CCMA, you can complain to the lender under the Central Bank’s Consumer Protection Code 2012 - see below
ga: Mura bhfuil tú sásta leis an mbealach a chaitheann an t-iasachtóir le do chás, nó má bhraitheann tú nár chomhlíon siad an CIRM, féadfaidh tú gearán a dhéanamh leis an iasachtóir faoi Chód um Chosaint Tomhaltóirí 2012 an Bhainc Cheannais

source: If you are not happy with the outcome of an appeal or complaint, you can refer to the Financial Services Ombudsman
ga: Mura bhfuil tú sásta le toradh achomhairc nó gearáin, féadfaidh tú an cheist a chur faoi bhráid an Ombudsman um Sheirbhísí Airgeadais

source: However, the Financial Services Ombudsman cannot pursue complaints against the Irish Bank Resolution Corporation (IBRC) without the consent of the High Court
ga: Nóta: ní féidir leis an Ombudsman um Sheirbhísí Airgeadais gearán a shaothrú i gcoinne Chorparáid na hÉireann um Réiteach Bainc (IBRC) gan toiliú na hArd-Chúirte

source: The Free Legal Advice Centres (FLAC) have published a guide to the Code of Conduct on Mortgage Arrears 2013 (pdf)
ga: D’fhoilsigh Ionaid Chomhairle Dlí Saor in Aisce (ICDSanna) treoir maidir leis an CIRM (pdf)

source: Consumer Protection Code 2012 The Central Bank's Consumer Protection Code 2012 applies to the regulated activities of regulated entities operating in the State
ga: Baineann Cód um Chosaint Tomhaltóirí 2012 an Bhainc Cheannais le gníomhaíochtaí rialaithe aonán rialaithe a oibríonn sa Stát

source: (These terms are explained in the 'Definitions' chapter of the Code.)
ga: (Mínítear na téarmaí seo sa chaibidil ‘Sainmhíniú’ den Chód.)

source: The Code includes requirements setting out how regulated entities must deal with and treat consumers who are in arrears on a range of loans including credit cards, personal loans and buy-to-let mortgages
ga: Áirítear leis an gCód ceanglais lena mbaineann a leagan amach conas ar cheart d’aonáin rialaithe déileáil le tomhaltóirí agus iad a láimhseáil atá i riaráistí ar réimse iasachtaí, lena n-áirítear cártaí creidmheasa, iasachtaí pearsanta agus morgáistí ceannaigh chun ligean

source: It does not apply to mortgages on a primary residence – these are covered by the Code of Conduct on Mortgage Arrears, described above
ga: Ní bhaineann sé le morgáistí ar phríomháit chónaithe – cuimsítear seo sa Chód Iompair do Riaráistí Morgáiste amhail a shonraítear thuas

source: The Consumer Protection Code requires lenders to seek to agree an approach that will assist a consumer in dealing with an arrears problem
ga: Ceanglaíonn an Cód um Chosaint Tomhaltóirí ar iasachtóirí féachaint le cur chuige a chomhaontú a chabhróidh le tomhaltóir maidir le déileáil le fadhb riaráistí

source: The Code also provides that the lender must:
ga: Foráiltear sa Chód, freisin, nach mór don iasachtóir:

source: • Have in place written procedures for handling arrears and make information available to you to assist you in dealing with arrears
ga: • Nósanna imeachta i scríbhinn a bheith i bhfeidhm maidir le riaráistí a láimhseáil agus chun faisnéis a chur ar fáil chun cabhrú leat maidir le déileáil le riaráistí

source: • Where your account remains in arrears 10 business days after the arrears first arose, immediately contact you to find out the reason for the arrears
ga: • Sa chás go bhfanann do chuntas i riaráistí deich lá i ndiaidh gur eascair na riaráistí, chun dul i dteagmháil leat láithreach chun cúis na riaráistí a dheimhniú

source: • Ensure that the level of contact and communications from them, or from any third party acting on their behalf, is proportionate and not excessive
ga: • A chinntiú gur comhréireach seachas iomarcach an leibhéal teagmhála agus cumarsáide uathu, nó ó aon tríú páirtí a ghníomhaíonn ar a son

source: • Initiate more than 3 unsolicited communications with you, by whatever means, in a calendar month, other than correspondence required by the CCMA or other regulatory requirements
ga: • Tús a chur le breis agus 3 chumarsáid gan iarraidh le hiasachtaí, ar cibé bealach, i mí féilire, seachas comhfhreagras a cheanglaítear faoin CIRM nó faoi cheanglais reachtúla eile

source: (This limit does not include missed calls or engaged numbers.)
ga: (Ní áirítear leis an teorainn seo gach glao nár freagraíodh ná uimhreacha gafa.)

source: The Consumer Protection Code 2012 replaces the original Consumer Protection Code, which came into effect in 2007
ga: Tháinig an Cód um Chosaint Tomhaltóirí 2012 in ionad an Bhunchóid um Chosaint Tomhaltóirí, á tháinig in éifeacht in 2007

source: The Central Bank has published a consumer guide to the Consumer Protection Code (pdf)
ga: D’fhoilsigh an Banc Ceannais treoir do thomhaltóirí maidir leis an gCód um Chosaint Tomhaltóirí (pdf)

source: Section 11 of the Housing (Miscellaneous Provisions) Act 1992 provides that the local authority may make such monetary arrangements with you as it considers equitable to take account of your particular circumstances
ga: Forálann Alt 11 d’Acht na dTithe (Forálacha Ilghnéitheacha), 1992 go bhféadfadh an t-údarás áitiúil a leithéid de shocruithe airgeadais a dhéanamh leat a mheasann siad a bheith cothrom cóir chun do chuid cúinsí ar leith a chur san áireamh

source: In effect, this means that, if you are having problems making your repayments, you should approach the local authority to see if you can make an arrangement to facilitate you paying over a longer term or to restructure the repayments in some other way
ga: Ciallaíonn sé sin go bunúsach, má tá fadhbanna agat do chuid aisíocaíochtaí a íoc, gur chóir duit dul chuig d’údarás áitiúil féachaint an féidir leat socrú a dhéanamh le cabhrú leat íoc thar thréimhse níos faide nó na híocaíochtaí a athstruchtúrú ar bhealach éigin eile

source: Detailed guidelines (pdf) have been issued to local authorities on how to deal with such cases
ga: Eisíodh treoirlínte d’údaráis áitiúla maidir le conas déileáil le cásanna dá samhail sin

source: These guidelines are based on the Central Bank’s Code of Conduct on Mortgage Arrears, described above
ga: Tá athbhreithniú á dhéanamh orthu faoi láthair i bhfianaise na n-athruithe atá á ndéanamh ar an CIRM
